PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_syslib.c
/***************************************************************************//**
* \file cy_syslib.c
* \version 3.80
*
*  Description:
*   Provides system API implementation for the SysLib driver.
*
********************************************************************************
* Copyright (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_M33SYSCPUSS) || defined (CY_IP_M4CPUSS) || defined (CY_IP_M7CPUSS) || defined(CY_IP_M55APPCPUSS)

#include "cy_syslib.h"

#if defined (CY_IP_M33SYSCPUSS) && defined(CY_IP_MXEFUSE)
    #include "cy_efuse.h"
#endif

#ifdef CY_IP_M4CPUSS
    #include "cy_ipc_drv.h"
#endif
#if !defined(NDEBUG)
    #include <string.h>
#endif /* NDEBUG */

#if defined (CY_DEVICE_SECURE)
    #include "cy_pra.h"
#endif /* defined (CY_DEVICE_SECURE) */

#ifdef CY_IP_M4CPUSS
    /* Flash wait states (ULP mode at 0.9v) */
    #define CY_SYSLIB_FLASH_ULP_WS_0_FREQ_MAX    ( 16UL)
    #define CY_SYSLIB_FLASH_ULP_WS_1_FREQ_MAX    ( 33UL)
    #define CY_SYSLIB_FLASH_ULP_WS_2_FREQ_MAX    ( 50UL)

    /* ROM and SRAM wait states for the slow clock domain (LP mode at 1.1v) */
    #define CY_SYSLIB_LP_SLOW_WS_0_FREQ_MAX      (100UL)
    #define CY_SYSLIB_LP_SLOW_WS_1_FREQ_MAX      (120UL)

    /* ROM and SRAM wait states for the slow clock domain (ULP mode at 0.9v) */
    #define CY_SYSLIB_ULP_SLOW_WS_0_FREQ_MAX     ( 25UL)
    #define CY_SYSLIB_ULP_SLOW_WS_1_FREQ_MAX     ( 50UL)
#elif (defined(CY_IP_M33SYSCPUSS) && (CY_IP_M33SYSCPUSS))
    /* These definitions can be removed once SystemCorClockUpdate() function is implemented */
    #define CY_SYSCLK_IMO_FREQ          (8000000UL) /* Hz */
    #define CY_DELAY_1K_THRESHOLD           (1000u)
    #define CY_DELAY_1K_MINUS_1_THRESHOLD   (CY_DELAY_1K_THRESHOLD - 1u)
    #define CY_DELAY_1M_THRESHOLD           (1000000u)
    #define CY_DELAY_1M_MINUS_1_THRESHOLD   (CY_DELAY_1M_THRESHOLD - 1u)

#elif defined(CY_IP_M7CPUSS)
    #define CY_SYSLIB_LP_SLOW_WS_0_FREQ_MAX      (100UL)

#endif


#if  defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS28SRSS) || defined(CY_IP_MXS22SRSS)
    #define CY_SRSS_RES_CAUSE2_CSV_LOSS_Msk    (SRSS_RES_CAUSE2_RESET_CSV_HF_Msk)
    #define CY_SRSS_RES_CAUSE2_CSV_LOSS_Pos    (SRSS_RES_CAUSE2_RESET_CSV_HF_Pos)
    #define CY_SRSS_RES_CAUSE2_CSV_ERROR_Msk    (SRSS_RES_CAUSE2_RESET_CSV_REF_Msk)
    #define CY_SRSS_RES_CAUSE2_CSV_ERROR_Pos    (SRSS_RES_CAUSE2_RESET_CSV_REF_Pos)
#endif

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
    /** Holds the flag to indicate if the System woke up from Warm Boot or not */
    bool cy_WakeupFromWarmBootStatus = false;
#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) */

#if !defined(NDEBUG)
    CY_NOINIT char_t cy_assertFileName[CY_MAX_FILE_NAME_SIZE + 1];
    CY_NOINIT uint32_t cy_assertLine;
#endif /* NDEBUG */

#if (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED)
    CY_NOINIT cy_stc_fault_frame_t cy_faultFrame;
#endif /* (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED) */

#if defined(__ARMCC_VERSION)
#if (__ARMCC_VERSION >= 6010050)
static void Cy_SysLib_AsmInfiniteLoop(void)
{
    __ASM(" b . ");
}
#else
static __ASM void Cy_SysLib_AsmInfiniteLoop(void)
{
    b .
}
#endif /* (__ARMCC_VERSION >= 6010050) */
#endif  /* (__ARMCC_VERSION) */

#if defined(CY_INIT_CODECOPY_ENABLE)
    CY_SECTION_INIT_CODECOPY_BEGIN
#endif
void Cy_SysLib_Delay(uint32_t milliseconds)
{
    uint32_t max_delay_ms = 0xFFFFFFFFU / (cy_delayFreqKhz * CY_SYSLIB_DELAY_CALIBRATION_FACTOR);

    while (milliseconds > max_delay_ms)
    {
        /* This loop prevents an overflow in value passed to Cy_SysLib_DelayCycles() API. */
        Cy_SysLib_DelayCycles(max_delay_ms * cy_delayFreqKhz * CY_SYSLIB_DELAY_CALIBRATION_FACTOR);
        milliseconds -= max_delay_ms;
    }

    Cy_SysLib_DelayCycles(milliseconds * cy_delayFreqKhz * CY_SYSLIB_DELAY_CALIBRATION_FACTOR);
}


void Cy_SysLib_DelayUs(uint16_t microseconds)
{
    Cy_SysLib_DelayCycles((uint32_t) microseconds * cy_delayFreqMhz * CY_SYSLIB_DELAY_CALIBRATION_FACTOR);
}

__WEAK void Cy_SysLib_Rtos_Delay(uint32_t milliseconds)
{
    Cy_SysLib_Delay(milliseconds);
}

__WEAK void Cy_SysLib_Rtos_DelayUs(uint16_t microseconds)
{
    Cy_SysLib_DelayUs(microseconds);
}

__NO_RETURN void Cy_SysLib_Halt(uint32_t reason)
{
    if (0U != reason)
    {
        /* To remove an unreferenced local variable warning */
    }

#if defined (__ARMCC_VERSION)
    __BKPT(0x0);
#elif defined(__GNUC__)
    CY_HALT();
#elif defined (__ICCARM__)
    CY_HALT();
#else
#error "An unsupported toolchain"
#endif  /* (__ARMCC_VERSION) */

    while (true) {}
}


__WEAK void Cy_SysLib_AssertFailed(const char_t * file, uint32_t line)
{
#if !defined(NDEBUG) || defined(CY_DOXYGEN)
    (void) strncpy(cy_assertFileName, file, CY_MAX_FILE_NAME_SIZE);
    cy_assertLine = line;
    Cy_SysLib_Halt(0UL);
#else
    (void) file;
    (void) line;
#endif  /* !defined(NDEBUG) || defined(CY_DOXYGEN) */
}

#ifdef CY_IP_M4CPUSS


void Cy_SysLib_ClearFlashCacheAndBuffer(void)
{
#if CY_CPU_CORTEX_M4 && defined(CY_DEVICE_SECURE)
    CY_PRA_REG32_SET(CY_PRA_INDX_FLASHC_FLASH_CMD, FLASHC_FLASH_CMD_INV_Msk);
#else
    FLASHC_FLASH_CMD = FLASHC_FLASH_CMD_INV_Msk;
#endif /* CY_CPU_CORTEX_M4 && defined(CY_DEVICE_SECURE) */
}
#endif


cy_en_syslib_status_t Cy_SysLib_ResetBackupDomain(void)
{
    BACKUP_RESET = BACKUP_RESET_RESET_Msk;
    return (Cy_SysLib_GetResetStatus());
}

