PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_syslib.c
uint64_t Cy_SysLib_GetUniqueId(void)
{
    uint32_t uniqueIdHi = 0;
    uint32_t uniqueIdLo = 0;
    uint32_t revId = 0;
    uint32_t dieRead[_CY_DIE_REG_COUNT];

    for (uint32_t i = 0; i < _CY_DIE_REG_COUNT; i++)
    {
        dieRead[i] = CY_GET_REG32(CY_RRAM_PROTECTED_NS_SFLASH_DIE + (uint32_t)(i * sizeof(uint32_t)));
    }
    revId = CY_GET_REG32(CY_RRAM_PROTECTED_NS_SFLASH_SI_REV);

    uniqueIdLo = (_FLD2VAL(CY_RRAM_PROTECTED_NS_SFLASH_DIE_LOT0,  dieRead[0])) << CY_UNIQUE_ID_DIE_LOT_0_Pos |
                 (_FLD2VAL(CY_RRAM_PROTECTED_NS_SFLASH_DIE_LOT1,  dieRead[0])) << CY_UNIQUE_ID_DIE_LOT_1_Pos |
                 (_FLD2VAL(CY_RRAM_PROTECTED_NS_SFLASH_DIE_LOT2,  dieRead[0])) << CY_UNIQUE_ID_DIE_LOT_2_Pos |
                 (_FLD2VAL(CY_RRAM_PROTECTED_NS_SFLASH_DIE_WAFER, dieRead[0])) << CY_UNIQUE_ID_DIE_WAFER_Pos;

    uniqueIdHi = (_FLD2VAL(CY_RRAM_PROTECTED_NS_SFLASH_DIE_X,    dieRead[1])) << (CY_UNIQUE_ID_DIE_X_Pos     - CY_UNIQUE_ID_DIE_X_Pos) |
                 (_FLD2VAL(CY_RRAM_PROTECTED_NS_SFLASH_DIE_Y,    dieRead[1])) << (CY_UNIQUE_ID_DIE_Y_Pos     - CY_UNIQUE_ID_DIE_X_Pos) |
                 (_FLD2VAL(CY_RRAM_PROTECTED_NS_SFLASH_DIE_SORT, dieRead[1])) << (CY_UNIQUE_ID_DIE_SORT_Pos  - CY_UNIQUE_ID_DIE_X_Pos) |
                 (_FLD2VAL(CY_RRAM_PROTECTED_NS_SFLASH_SI_REV_MINOR,  revId)) << (CY_UNIQUE_ID_DIE_MINOR_Pos - CY_UNIQUE_ID_DIE_X_Pos) |
                 (_FLD2VAL(CY_RRAM_PROTECTED_NS_SFLASH_DIE_YEAR, dieRead[2])) << (CY_UNIQUE_ID_DIE_YEAR_Pos  - CY_UNIQUE_ID_DIE_X_Pos);

    return (((uint64_t) uniqueIdHi << CY_UNIQUE_ID_DIE_X_Pos) | uniqueIdLo);
}
#endif

#if defined(CY_INIT_CODECOPY_ENABLE)
    CY_SECTION_INIT_CODECOPY_END
#endif

#if (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED)


void Cy_SysLib_FaultHandler(uint32_t const *faultStackAddr)
{
    /* Stores general registers */
    cy_faultFrame.r0  = faultStackAddr[CY_R0_Pos];
    cy_faultFrame.r1  = faultStackAddr[CY_R1_Pos];
    cy_faultFrame.r2  = faultStackAddr[CY_R2_Pos];
    cy_faultFrame.r3  = faultStackAddr[CY_R3_Pos];
    cy_faultFrame.r12 = faultStackAddr[CY_R12_Pos];
    cy_faultFrame.lr  = faultStackAddr[CY_LR_Pos];
    cy_faultFrame.pc  = faultStackAddr[CY_PC_Pos];
    cy_faultFrame.psr = faultStackAddr[CY_PSR_Pos];

#if (defined (CY_IP_M4CPUSS) || defined (CY_IP_M7CPUSS) || CY_IP_M33SYSCPUSS || CY_IP_M55APPCPUSS)
#if (CY_CPU_CORTEX_M4 || (defined (CY_CPU_CORTEX_M7) && CY_CPU_CORTEX_M7) || \
     (defined (CY_CPU_CORTEX_M33) && CY_CPU_CORTEX_M33) || (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55))
    /* Stores the Configurable Fault Status Register state with the fault cause */
    cy_faultFrame.cfsr.cfsrReg = SCB->CFSR;
    /* Stores the Hard Fault Status Register */
    cy_faultFrame.hfsr.hfsrReg = SCB->HFSR;
    /* Stores the System Handler Control and State Register */
    cy_faultFrame.shcsr.shcsrReg = SCB->SHCSR;
    /* Store MemMange fault address */
    cy_faultFrame.mmfar = SCB->MMFAR;
    /* Store Bus fault address */
    cy_faultFrame.bfar = SCB->BFAR;

#if ((defined (__FPU_PRESENT) && (__FPU_PRESENT == 1U)) && \
     (defined (__FPU_USED   ) && (__FPU_USED    == 1U)))
    /* Checks cumulative exception bits for floating-point exceptions */
    if (0U != (__get_FPSCR() & (CY_FPSCR_IXC_Msk | CY_FPSCR_IDC_Msk)))
    {
        cy_faultFrame.s0    = faultStackAddr[CY_S0_Pos];
        cy_faultFrame.s1    = faultStackAddr[CY_S1_Pos];
        cy_faultFrame.s2    = faultStackAddr[CY_S2_Pos];
        cy_faultFrame.s3    = faultStackAddr[CY_S3_Pos];
        cy_faultFrame.s4    = faultStackAddr[CY_S4_Pos];
        cy_faultFrame.s5    = faultStackAddr[CY_S5_Pos];
        cy_faultFrame.s6    = faultStackAddr[CY_S6_Pos];
        cy_faultFrame.s7    = faultStackAddr[CY_S7_Pos];
        cy_faultFrame.s8    = faultStackAddr[CY_S8_Pos];
        cy_faultFrame.s9    = faultStackAddr[CY_S9_Pos];
        cy_faultFrame.s10   = faultStackAddr[CY_S10_Pos];
        cy_faultFrame.s11   = faultStackAddr[CY_S11_Pos];
        cy_faultFrame.s12   = faultStackAddr[CY_S12_Pos];
        cy_faultFrame.s13   = faultStackAddr[CY_S13_Pos];
        cy_faultFrame.s14   = faultStackAddr[CY_S14_Pos];
        cy_faultFrame.s15   = faultStackAddr[CY_S15_Pos];
        cy_faultFrame.fpscr = faultStackAddr[CY_FPSCR_Pos];
    }
#endif /* __FPU_PRESENT */
#endif /* CY_CPU_CORTEX_M4, CY_CPU_CORTEX_M7, CY_CPU_CORTEX_M33, CY_CPU_CORTEX_M55 */
#endif
    Cy_SysLib_ProcessingFault();
}


__WEAK void Cy_SysLib_ProcessingFault(void)
{
#if defined(__ARMCC_VERSION)
    /* Assembly implementation of an infinite loop
     * is used for the armcc compiler to preserve the call stack.
     * Otherwise, the compiler destroys the call stack,
     * because treats this API as a no return function.
     */
    Cy_SysLib_AsmInfiniteLoop();
#else
    while (true) {}
#endif  /* (__ARMCC_VERSION) */
}
#endif /* (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED) || defined(CY_DOXYGEN) */

#if defined(CY_INIT_CODECOPY_ENABLE)
    CY_SECTION_INIT_CODECOPY_BEGIN
#endif

void Cy_SysLib_SetWaitStates(bool ulpMode, uint32_t clkHfMHz)
{
#if defined(CY_IP_M4CPUSS) || defined(CY_IP_M7CPUSS)
#if !((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE))) || defined(CY_IP_M7CPUSS)
    uint32_t waitStates;
    uint32_t freqMax;

#if defined(CY_IP_M7CPUSS)
    CY_ASSERT_L1(ulpMode == false);
#endif

#if defined(CY_IP_M7CPUSS)
    freqMax = CY_SYSLIB_LP_SLOW_WS_0_FREQ_MAX;
#else
    freqMax = ulpMode ? CY_SYSLIB_ULP_SLOW_WS_0_FREQ_MAX : CY_SYSLIB_LP_SLOW_WS_0_FREQ_MAX;
#endif
    waitStates = (clkHfMHz <= freqMax) ? 0UL : 1UL;

    /* ROM */
    CPUSS_ROM_CTL = _CLR_SET_FLD32U(CPUSS_ROM_CTL, CPUSS_ROM_CTL_SLOW_WS, waitStates);
    CPUSS_ROM_CTL = _CLR_SET_FLD32U(CPUSS_ROM_CTL, CPUSS_ROM_CTL_FAST_WS, 0UL);

    /* SRAM */
    CPUSS_RAM0_CTL0 = _CLR_SET_FLD32U(CPUSS_RAM0_CTL0, CPUSS_RAM0_CTL0_SLOW_WS, waitStates);
    CPUSS_RAM0_CTL0 = _CLR_SET_FLD32U(CPUSS_RAM0_CTL0, CPUSS_RAM0_CTL0_FAST_WS, 0UL);
#if defined (RAMC1_PRESENT) && (RAMC1_PRESENT == 1UL)
    CPUSS_RAM1_CTL0 = _CLR_SET_FLD32U(CPUSS_RAM1_CTL0, CPUSS_RAM1_CTL0_SLOW_WS, waitStates);
    CPUSS_RAM1_CTL0 = _CLR_SET_FLD32U(CPUSS_RAM1_CTL0, CPUSS_RAM1_CTL0_FAST_WS, 0UL);
#endif /* defined (RAMC1_PRESENT) && (RAMC1_PRESENT == 1UL) */
#if defined (RAMC2_PRESENT) && (RAMC2_PRESENT == 1UL)
    CPUSS_RAM2_CTL0 = _CLR_SET_FLD32U(CPUSS_RAM2_CTL0, CPUSS_RAM2_CTL0_SLOW_WS, waitStates);
    CPUSS_RAM2_CTL0 = _CLR_SET_FLD32U(CPUSS_RAM2_CTL0, CPUSS_RAM2_CTL0_FAST_WS, 0UL);
#endif /* defined (RAMC2_PRESENT) && (RAMC2_PRESENT == 1UL) */

    /* Flash */
#if defined(CY_IP_M7CPUSS)
    if (clkHfMHz <= CY_SYSLIB_LP_SLOW_WS_0_FREQ_MAX)
    {
        waitStates = 0UL;
    }
    else
    {
        waitStates = 1UL;
    }

    FLASHC_FLASH_CTL = _CLR_SET_FLD32U(FLASHC_FLASH_CTL, FLASHC_FLASH_CTL_WS, waitStates);

#else
    if (ulpMode)
    {
        waitStates = (clkHfMHz <= CY_SYSLIB_FLASH_ULP_WS_0_FREQ_MAX) ? 0UL :
                     ((clkHfMHz <= CY_SYSLIB_FLASH_ULP_WS_1_FREQ_MAX) ? 1UL : 2UL);
    }
    else
    {
        waitStates = (clkHfMHz <= cy_device->flashCtlMainWs0Freq) ? 0UL :
                     ((clkHfMHz <= cy_device->flashCtlMainWs1Freq) ? 1UL :
                      ((clkHfMHz <= cy_device->flashCtlMainWs2Freq) ? 2UL :
                       ((clkHfMHz <= cy_device->flashCtlMainWs3Freq) ? 3UL :
                        ((clkHfMHz <= cy_device->flashCtlMainWs4Freq) ? 4UL : 5UL))));
    }

    FLASHC_FLASH_CTL = _CLR_SET_FLD32U(FLASHC_FLASH_CTL, FLASHC_FLASH_CTL_MAIN_WS, waitStates);
#endif

#else
    (void) ulpMode;
    (void) clkHfMHz;
#endif /* !((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE))) || defined(CY_IP_M7CPUSS) */
#endif /* defined(CY_IP_M4CPUSS) || defined(CY_IP_M7CPUSS) */
#if (defined(CY_PDL_TZ_ENABLED) && defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL))
    uint32_t waitStates;

    if (ulpMode)
    {
        waitStates = ((CY_SYSLIB_COEFFICIENT_ULP * clkHfMHz) / 1000U) + 1U;
    }
    else
    {
        waitStates = ((CY_SYSLIB_COEFFICIENT * clkHfMHz) / 1000U) + 1U;
    }

    FLASHC_FLASH_CTL = _CLR_SET_FLD32U(FLASHC_FLASH_CTL, FLASHC_FLASH_CTL_RBUS_WS, waitStates);
#else
    (void) ulpMode;
    (void) clkHfMHz;
#endif
}


uint8_t Cy_SysLib_GetDeviceRevision(void)
{
#if defined (CY_IP_M4CPUSS) && !(defined (SRSS_HT_VARIANT) && (SRSS_HT_VARIANT == 1u))
    return ((SFLASH_SI_REVISION_ID == 0UL) ? CY_SYSLIB_DEVICE_REV_0A : SFLASH_SI_REVISION_ID);
#elif defined(CY_IP_M33SYSCPUSS) || defined(CY_IP_M7CPUSS) || (defined (SRSS_HT_VARIANT) && (SRSS_HT_VARIANT == 1u))
    return ((uint8_t)((_FLD2VAL(CPUSS_PRODUCT_ID_MINOR_REV, CPUSS_PRODUCT_ID) << 4U) | _FLD2VAL(CPUSS_PRODUCT_ID_MAJOR_REV, CPUSS_PRODUCT_ID)));
#else
    return 0;
#endif
}

